## SQL!!!!!

How much to you remember?

In [1]:
import sqlite3
import pandas as pd

con = sqlite3.connect('./data/flights.db')

Remember the schema.

In [2]:
schema_df = pd.read_sql("""

SELECT *
FROM sqlite_master


""", con)

schema_df

,type,name,tbl_name,rootpage,sql
0,table,airports,airports,2,"CREATE TABLE airports (\n[index] INTEGER,\n [..."
1,index,ix_airports_index,airports,3,CREATE INDEX ix_airports_index ON airports ([i...
2,table,airlines,airlines,945,"CREATE TABLE airlines (\n[index] INTEGER,\n [..."
3,index,ix_airlines_index,airlines,946,CREATE INDEX ix_airlines_index ON airlines ([i...
4,table,routes,routes,1393,"CREATE TABLE routes (\n[index] INTEGER,\n [ai..."
5,index,ix_routes_index,routes,1394,CREATE INDEX ix_routes_index ON routes ([index])

Let's get a list of all the table names

In [3]:
table_names = list(schema_df[ schema_df['type'] == 'table']['tbl_name'])

Now, let's step through that list and display one row from each table

In [4]:
for table in table_names:
    qry = """
    SELECT *
    FROM {}
    LIMIT 1
    """.format(table)
    
    print(f'First row for table {table}')
    display(pd.read_sql(qry, con))
    print('\n\n')

First row for table airports

,index,id,name,city,country,code,icao,latitude,longitude,altitude,offset,dst,timezone
0,0,1,Goroka,Goroka,Papua New Guinea,GKA,AYGA,-6.081689,145.391881,5282,10,U,Pacific/Port_Moresby

First row for table airlines

   index id            name alias iata  icao callsign country active
0      0  1  Private flight    \N    -  None     None    None      Y

First row for table routes

,index,airline,airline_id,source,source_id,dest,dest_id,codeshare,stops,equipment
0,0,2B,410,AER,2965,KZN,2990,None,0,CR2

### Simple Query

Which country has the most airports? Which one has the least?

### Where?

Which airports are in the `Pacific/Port_Moresby` time zone? What city and country?

### Further down the rabbit hole!

Which countries have between 50 and 100 airports?

### Joins!

What is the name of the airline has the most routes? The fewest?

### Subqueries/CTEs!

What is the average number of routes per airline?

In [9]:
qry5 = """SELECT COUNT()
FROM routes
GROUP BY airline_id
"""
pd.read_sql(qry5, con)

     COUNT()
0          4
1        118
2          4
3         25
4         48
..       ...
536       62
537       10
538       32
539        8
540      678

[541 rows x 1 columns]

In [11]:
qry4 = """
WITH avg_routes AS (
        SELECT COUNT() as average_routes
        FROM routes
        GROUP BY airline_id)
SELECT name, avg_routes
FROM airlines



"""
pd.read_sql(qry5, con)

     COUNT()
0          4
1        118
2          4
3         25
4         48
..       ...
536       62
537       10
538       32
539        8
540      678

[541 rows x 1 columns]

### Multiple Joins!

What is the name of the airline with the most departing flights in the `Pacific/Port_Moresby` timezone?